MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX530F128H.PIC
      <edc:AdjustPoint edc:_addr="0x1F809030" edc:offset="16"/>
      <edc:SFRDef edc:_addr="0x1F809040" edc:_begin="0x40" edc:_end="0x164" edc:_modsrc="DOS-02486_adc_1012_pb_v2.Module" edc:_refcount="2" edc:access="n-nnnnnnn-nnnnnn----------------" edc:cname="AD1CHS" edc:desc="" edc:grp="ADC10" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-xxxxxx0-xxxxxx----------------" edc:name="AD1CHS" edc:nzwidth="0x20" edc:por="0-xxxxxx0-xxxxxx----------------" edc:portals="CLR SET INV" ltx:memberofperipheral="ADC10">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="16"/>
            <edc:SFRFieldDef edc:cname="CH0SA" edc:desc="" edc:mask="0x3f" edc:name="CH0SA" edc:nzwidth="6"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CH0NA" edc:desc="" edc:mask="0x1" edc:name="CH0NA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH0SB" edc:desc="" edc:mask="0x3f" edc:name="CH0SB" edc:nzwidth="6"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CH0NB" edc:desc="" edc:mask="0x1" edc:name="CH0NB" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="CH0SA0" edc:desc="" edc:mask="0x1" edc:name="CH0SA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH0SA1" edc:desc="" edc:mask="0x1" edc:name="CH0SA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH0SA2" edc:desc="" edc:mask="0x1" edc:name="CH0SA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH0SA3" edc:desc="" edc:mask="0x1" edc:name="CH0SA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH0SA4" edc:mask="0x1" edc:name="CH0SA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CH0SB0" edc:desc="" edc:mask="0x1" edc:name="CH0SB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH0SB1" edc:desc="" edc:mask="0x1" edc:name="CH0SB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH0SB2" edc:desc="" edc:mask="0x1" edc:name="CH0SB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH0SB3" edc:desc="" edc:mask="0x1" edc:name="CH0SB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH0SB4" edc:mask="0x1" edc:name="CH0SB4" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F809050" edc:_begin="0x40" edc:_end="0x164" edc:_modsrc="DOS-02486_adc_1012_pb_v2.Module" edc:_refcount="2" edc:access="----nnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="AD1CSSL" edc:desc="" edc:grp="ADC10" edc:impl="0xfffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----xxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="AD1CSSL" edc:nzwidth="0x20" edc:por="----xxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="ADC10">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CSSL0" edc:desc="" edc:mask="0x1" edc:name="CSSL0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL1" edc:desc="" edc:mask="0x1" edc:name="CSSL1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL2" edc:desc="" edc:mask="0x1" edc:name="CSSL2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL3" edc:desc="" edc:mask="0x1" edc:name="CSSL3" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL4" edc:desc="" edc:mask="0x1" edc:name="CSSL4" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL5" edc:desc="" edc:mask="0x1" edc:name="CSSL5" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL6" edc:desc="" edc:mask="0x1" edc:name="CSSL6" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL7" edc:desc="" edc:mask="0x1" edc:name="CSSL7" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL8" edc:desc="" edc:mask="0x1" edc:name="CSSL8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL9" edc:desc="" edc:mask="0x1" edc:name="CSSL9" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL10" edc:desc="" edc:mask="0x1" edc:name="CSSL10" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL11" edc:desc="" edc:mask="0x1" edc:name="CSSL11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL12" edc:desc="" edc:mask="0x1" edc:name="CSSL12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL13" edc:desc="" edc:mask="0x1" edc:name="CSSL13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL14" edc:desc="" edc:mask="0x1" edc:name="CSSL14" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL15" edc:desc="" edc:mask="0x1" edc:name="CSSL15" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL16" edc:desc="" edc:mask="0x1" edc:name="CSSL16" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL17" edc:desc="" edc:mask="0x1" edc:name="CSSL17" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL18" edc:desc="" edc:mask="0x1" edc:name="CSSL18" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL19" edc:desc="" edc:mask="0x1" edc:name="CSSL19" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL20" edc:desc="" edc:mask="0x1" edc:name="CSSL20" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL21" edc:desc="" edc:mask="0x1" edc:name="CSSL21" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL22" edc:desc="" edc:mask="0x1" edc:name="CSSL22" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL23" edc:desc="" edc:mask="0x1" edc:name="CSSL23" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL24" edc:desc="" edc:mask="0x1" edc:name="CSSL24" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL25" edc:desc="" edc:mask="0x1" edc:name="CSSL25" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL26" edc:desc="" edc:mask="0x1" edc:name="CSSL26" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSSL27" edc:desc="" edc:mask="0x1" edc:name="CSSL27" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="CSSL" edc:desc="" edc:mask="0xfffffff" edc:name="CSSL" edc:nzwidth="32"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
